help_text = 'Для использования бота, вот пошаговая инструкция с перечислением команд и их коротким описанием: \n'\
    '1. Отправьте сообщение "привет" для активации бота. \n'\
    ' Бот отправит приветственное сообщение и предложит команду "поиск". \n'\
    '2 - Отправьте сообщение "поиск" для начала поиска пользователей. \n'\
    ' Если у вас уже есть сохраненные параметры поиска, бот начнет поиск пользователей согласно этим параметрам. \n'\
    ' - Если у вас нет сохраненных параметров, бот предложит изменить параметры поиска. \n'\
    '3. Отправьте команду "другой город", чтобы изменить город поиска. \n'\
    ' - Бот попросит вас подтвердить изменение города и ввести новое название города. \n'\
    '4. Отправьте команду "дата рождения", чтобы изменить дату рождения. \n'\
    ' - Бот попросит вас подтвердить изменение и ввести новую дату рождения в формате ДД.ММ.ГГГГ. \n'\
    '5. Отправьте команду "пока", чтобы завершить общение с ботом. \n'\
    ' - Бот отправит прощальное сообщение. \n'\
    'Команды "поиск", "другой город" и "дата рождения" позволяют изменять параметры поиска \n'\
    'для поиска подходящих пользователей. Если у вас возникнут вопросы или понадобится помощь, вы можете обратиться \n'\
    'к боту, отправив соответствующую команду или написав "помощь".'
